rammp-org/prototype-fw/holo_deck/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# The Tab5's ESP32-P4 is an older chip revision. Revisions below v3.0 use a
# different hardware configuration and must be selected explicitly.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 16 MB flash on the Tab5
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Memory configuration
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

CONFIG_ESP_SYSTEM_USE_FRAME_POINTER=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

#
# Partition Table (the default table is too small for the LVGL + BSP app)
#
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_OFFSET=0x9000
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS configuration (1 kHz tick so the 20 ms control/joystick timers
# resolve accurately)
CONFIG_FREERTOS_HZ=1000

# M5Stack Tab5 BSP configuration
# Raised from the 4 KB BSP default: the interrupt task runs the touch-
# controller I2C reads and, on a bus error, logs through espp's fmt
# color-print path, which needs more than 4 KB of stack.
CONFIG_M5STACK_TAB5_INTERRUPT_STACK_SIZE=8192

# PSRAM configuration (32 MB on the Tab5; the LVGL draw buffers live here)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# ESP Timer configuration
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144

# LVGL Configuration
CONFIG_LV_DEF_REFR_PERIOD=16

#
# LVGL configuration - # Themes
#
CONFIG_LV_USE_THEME_DEFAULT=y
CONFIG_LV_THEME_DEFAULT_DARK=y
CONFIG_LV_THEME_DEFAULT_GROW=y
CONFIG_LV_THEME_DEFAULT_TRANSITION_TIME=30
